nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.c
/*
* Copyright 2023 NXP
* All rights reserved.
*
* SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.1
processor: LPC865
package_id: LPC865M201JBD64
mcu_data: ksdk2_0
processor_version: 13.0.0
pin_labels:
- {pin_num: '18', pin_signal: PIO1_1, label: LED_B_P, identifier: LED_B_P}
- {pin_num: '20', pin_signal: PIO1_2, label: LED_B_N, identifier: LED_B_N}
- {pin_num: '29', pin_signal: PIO1_3, label: LED_R_P, identifier: LED_R_P}
- {pin_num: '31', pin_signal: PIO1_4, label: LED_R_N, identifier: LED_R_N}
- {pin_num: '35', pin_signal: PIO1_5, label: LED_G_P, identifier: LED_G_P}
- {pin_num: '38', pin_signal: PIO1_6, label: LED_G_N, identifier: LED_G_N}
- {pin_num: '46', pin_signal: PIO0_6/ADC_1/ACMPVREF, label: ADC_LED_G, identifier: ADC_LED_G}
- {pin_num: '51', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: ADC_LED_B, identifier: ADC_LED_B}
- {pin_num: '61', pin_signal: PIO0_18/ADC_8, label: ADC_ALS, identifier: ADC_ALS}
- {pin_num: '63', pin_signal: PIO0_17/ADC_9, label: ADC_NTC, identifier: ADC_NTC}
- {pin_num: '2', pin_signal: PIO0_13/ADC_10, label: ADC_POT, identifier: ADC_POT}
- {pin_num: '49', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: ADC_LED_R, identifier: ADC_LED_R}
- {pin_num: '60', pin_signal: PIO0_19/ADC_7, label: DBG0, identifier: DBG0}
- {pin_num: '58', pin_signal: PIO0_20/ADC_6, label: DBG1, identifier: DBG1}
- {pin_num: '30', pin_signal: PIO0_15, label: TX, identifier: DALI_RX;RX;TX}
- {pin_num: '19', pin_signal: PIO0_16, label: RX, identifier: DALI_TX;TX;RX}
- {pin_num: '6', pin_signal: PIO0_4/ADC_11, label: BTN_USR, identifier: BTN_USR}
- {pin_num: '57', pin_signal: PIO0_21/ADC_5, label: DBG2, identifier: DBG2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDbgUARTPins();
    BOARD_InitSYSPins();
    BOARD_InitI2CPins();
    BOARD_InitDbgPins();
    BOARD_InitDALIPins();
    BOARD_InitBTNPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDbgUARTPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '27', peripheral: USART0, signal: TXD, pin_signal: PIO0_25}
  - {pin_num: '28', peripheral: USART0, signal: RXD, pin_signal: PIO0_24}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDbgUARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitDbgUARTPins(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* USART0_TXD connect to P0_25 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_TXD, kSWM_PortPin_P0_25);

    /* USART0_RXD connect to P0_24 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_RXD, kSWM_PortPin_P0_24);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSYSPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '33', peripheral: SYSCON, signal: XTALOUT, pin_signal: PIO0_9/XTALOUT}
  - {pin_num: '34', peripheral: SYSCON, signal: XTALIN, pin_signal: PIO0_8/XTALIN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSYSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitSYSPins(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* XTALIN connect to P0_8 */
    SWM_SetFixedPinSelect(SWM0, kSWM_XTALIN, true);

    /* XTALOUT connect to P0_9 */
    SWM_SetFixedPinSelect(SWM0, kSWM_XTALOUT, true);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '18', peripheral: FTM0, signal: 'CH, 0', pin_signal: PIO1_1}
  - {pin_num: '20', peripheral: FTM0, signal: 'CH, 1', pin_signal: PIO1_2}
  - {pin_num: '29', peripheral: FTM0, signal: 'CH, 2', pin_signal: PIO1_3}
  - {pin_num: '31', peripheral: FTM0, signal: 'CH, 3', pin_signal: PIO1_4}
  - {pin_num: '35', peripheral: FTM0, signal: 'CH, 4', pin_signal: PIO1_5}
  - {pin_num: '38', peripheral: FTM0, signal: 'CH, 5', pin_signal: PIO1_6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

