nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitLEDPins(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* FTM0_CH0 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH0, kSWM_FTM_Selection1);

    /* FTM0_CH1 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH1, kSWM_FTM_Selection1);

    /* FTM0_CH2 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH2, kSWM_FTM_Selection1);

    /* FTM0_CH3 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH3, kSWM_FTM_Selection1);

    /* FTM0_CH4 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH4, kSWM_FTM_Selection1);

    /* FTM0_CH5 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH5, kSWM_FTM_Selection1);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDPins_deinit
 * Description   : This is a de-initialization function for 'BOARD_InitLEDPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitLEDPins_deinit(void)
{
    /* Enables clock for IOCON.: enable */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t LED_B_P_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 18)  */
    GPIO_PinInit(BOARD_INITLEDPINS_DEINIT_LED_B_P_GPIO, BOARD_INITLEDPINS_DEINIT_LED_B_P_PORT, BOARD_INITLEDPINS_DEINIT_LED_B_P_PIN, &LED_B_P_config);

    gpio_pin_config_t LED_B_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 20)  */
    GPIO_PinInit(BOARD_INITLEDPINS_DEINIT_LED_B_N_GPIO, BOARD_INITLEDPINS_DEINIT_LED_B_N_PORT, BOARD_INITLEDPINS_DEINIT_LED_B_N_PIN, &LED_B_N_config);

    gpio_pin_config_t LED_R_P_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 29)  */
    GPIO_PinInit(BOARD_INITLEDPINS_DEINIT_LED_R_P_GPIO, BOARD_INITLEDPINS_DEINIT_LED_R_P_PORT, BOARD_INITLEDPINS_DEINIT_LED_R_P_PIN, &LED_R_P_config);

    gpio_pin_config_t LED_R_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_4 (pin 31)  */
    GPIO_PinInit(BOARD_INITLEDPINS_DEINIT_LED_R_N_GPIO, BOARD_INITLEDPINS_DEINIT_LED_R_N_PORT, BOARD_INITLEDPINS_DEINIT_LED_R_N_PIN, &LED_R_N_config);

    gpio_pin_config_t LED_G_P_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin 35)  */
    GPIO_PinInit(BOARD_INITLEDPINS_DEINIT_LED_G_P_GPIO, BOARD_INITLEDPINS_DEINIT_LED_G_P_PORT, BOARD_INITLEDPINS_DEINIT_LED_G_P_PIN, &LED_G_P_config);

    gpio_pin_config_t LED_G_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 38)  */
    GPIO_PinInit(BOARD_INITLEDPINS_DEINIT_LED_G_N_GPIO, BOARD_INITLEDPINS_DEINIT_LED_G_N_PORT, BOARD_INITLEDPINS_DEINIT_LED_G_N_PIN, &LED_G_N_config);

    const uint32_t LED_B_P = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO1 PIN1 (coords: 18) is configured as GPIO, PIO1, 1. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_1, LED_B_P);

    const uint32_t LED_B_N = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO1 PIN2 (coords: 20) is configured as GPIO, PIO1, 2. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_2, LED_B_N);

    const uint32_t LED_R_P = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO1 PIN3 (coords: 29) is configured as GPIO, PIO1, 3. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_3, LED_R_P);

