nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.c
    const uint32_t LED_R_N = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO1 PIN4 (coords: 31) is configured as GPIO, PIO1, 4. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_4, LED_R_N);

    const uint32_t LED_G_P = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO1 PIN5 (coords: 35) is configured as GPIO, PIO1, 5. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_5, LED_G_P);

    const uint32_t LED_G_N = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO1 PIN6 (coords: 38) is configured as GPIO, PIO1, 6. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_6, LED_G_N);

    /* FTM0_CH0 connect to no pin */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH0, kSWM_FTM_Selection3);

    /* FTM0_CH1 connect to no pin */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH1, kSWM_FTM_Selection3);

    /* FTM0_CH2 connect to no pin */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH2, kSWM_FTM_Selection3);

    /* FTM0_CH3 connect to no pin */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH3, kSWM_FTM_Selection3);

    /* FTM0_CH4 connect to no pin */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH4, kSWM_FTM_Selection3);

    /* FTM0_CH5 connect to no pin */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH5, kSWM_FTM_Selection3);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADCPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '63', peripheral: ADC0, signal: 'CH, 9', pin_signal: PIO0_17/ADC_9}
  - {pin_num: '49', peripheral: ADC0, signal: 'CH, 2', pin_signal: PIO0_14/ACMP_I3/ADC_2}
  - {pin_num: '46', peripheral: ADC0, signal: 'CH, 1', pin_signal: PIO0_6/ADC_1/ACMPVREF}
  - {pin_num: '51', peripheral: ADC0, signal: 'CH, 3', pin_signal: PIO0_23/ADC_3/ACMP_I4}
  - {pin_num: '2', peripheral: ADC0, signal: 'CH, 10', pin_signal: PIO0_13/ADC_10}
  - {pin_num: '61', peripheral: ADC0, signal: 'CH, 8', pin_signal: PIO0_18/ADC_8}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitADCPins(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* ADC_CHN1 connect to P0_6 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN1, true);

    /* ADC_CHN2 connect to P0_14 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN2, true);

    /* ADC_CHN3 connect to P0_23 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN3, true);

    /* ADC_CHN8 connect to P0_18 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN8, true);

    /* ADC_CHN9 connect to P0_17 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN9, true);

    /* ADC_CHN10 connect to P0_13 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN10, true);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADCPins_deinit
 * Description   : This is a de-initialization function for 'BOARD_InitADCPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitADCPins_deinit(void)
{
    /* Enables clock for IOCON.: enable */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t ADC_LED_G_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 46)  */
    GPIO_PinInit(BOARD_INITADCPINS_DEINIT_ADC_LED_G_GPIO, BOARD_INITADCPINS_DEINIT_ADC_LED_G_PORT, BOARD_INITADCPINS_DEINIT_ADC_LED_G_PIN, &ADC_LED_G_config);

    gpio_pin_config_t ADC_POT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 2)  */
    GPIO_PinInit(BOARD_INITADCPINS_DEINIT_ADC_POT_GPIO, BOARD_INITADCPINS_DEINIT_ADC_POT_PORT, BOARD_INITADCPINS_DEINIT_ADC_POT_PIN, &ADC_POT_config);

    gpio_pin_config_t ADC_LED_R_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 49)  */
    GPIO_PinInit(BOARD_INITADCPINS_DEINIT_ADC_LED_R_GPIO, BOARD_INITADCPINS_DEINIT_ADC_LED_R_PORT, BOARD_INITADCPINS_DEINIT_ADC_LED_R_PIN, &ADC_LED_R_config);

