nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.c
    gpio_pin_config_t ADC_NTC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 63)  */
    GPIO_PinInit(BOARD_INITADCPINS_DEINIT_ADC_NTC_GPIO, BOARD_INITADCPINS_DEINIT_ADC_NTC_PORT, BOARD_INITADCPINS_DEINIT_ADC_NTC_PIN, &ADC_NTC_config);

    gpio_pin_config_t gpio0_pin0_18 = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 61)  */
    GPIO_PinInit(GPIO, 0U, 18U, &gpio0_pin0_18);

    gpio_pin_config_t ADC_LED_B_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 51)  */
    GPIO_PinInit(BOARD_INITADCPINS_DEINIT_ADC_LED_B_GPIO, BOARD_INITADCPINS_DEINIT_ADC_LED_B_PORT, BOARD_INITADCPINS_DEINIT_ADC_LED_B_PIN, &ADC_LED_B_config);

    const uint32_t ADC_POT = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO0 PIN13 (coords: 2) is configured as GPIO, PIO0, 13. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_13, ADC_POT);

    const uint32_t ADC_LED_R = (/* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Enable hysteresis */
                                IOCON_PIO_HYS_EN |
                                /* Input not invert */
                                IOCON_PIO_INV_DI |
                                /* Disables Open-drain function */
                                IOCON_PIO_OD_DI |
                                /* Bypass input filter */
                                IOCON_PIO_SMODE_BYPASS |
                                /* IOCONCLKDIV0 */
                                IOCON_PIO_CLKDIV0);
    /* PIO0 PIN14 (coords: 49) is configured as GPIO, PIO0, 14. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_14, ADC_LED_R);

    const uint32_t ADC_NTC = (/* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Enable hysteresis */
                              IOCON_PIO_HYS_EN |
                              /* Input not invert */
                              IOCON_PIO_INV_DI |
                              /* Disables Open-drain function */
                              IOCON_PIO_OD_DI |
                              /* Bypass input filter */
                              IOCON_PIO_SMODE_BYPASS |
                              /* IOCONCLKDIV0 */
                              IOCON_PIO_CLKDIV0);
    /* PIO0 PIN17 (coords: 63) is configured as GPIO, PIO0, 17. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_17, ADC_NTC);

    const uint32_t IOCON_INDEX_PIO0_18_config = (/* No addition pin function */
                                                 IOCON_PIO_MODE_INACT |
                                                 /* Enable hysteresis */
                                                 IOCON_PIO_HYS_EN |
                                                 /* Input not invert */
                                                 IOCON_PIO_INV_DI |
                                                 /* Disables Open-drain function */
                                                 IOCON_PIO_OD_DI |
                                                 /* Bypass input filter */
                                                 IOCON_PIO_SMODE_BYPASS |
                                                 /* IOCONCLKDIV0 */
                                                 IOCON_PIO_CLKDIV0);
    /* PIO0 PIN18 (coords: 61) is configured as GPIO, PIO0, 18. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_18, IOCON_INDEX_PIO0_18_config);

    const uint32_t ADC_LED_B = (/* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Enable hysteresis */
                                IOCON_PIO_HYS_EN |
                                /* Input not invert */
                                IOCON_PIO_INV_DI |
                                /* Disables Open-drain function */
                                IOCON_PIO_OD_DI |
                                /* Bypass input filter */
                                IOCON_PIO_SMODE_BYPASS |
                                /* IOCONCLKDIV0 */
                                IOCON_PIO_CLKDIV0);
    /* PIO0 PIN23 (coords: 51) is configured as GPIO, PIO0, 23. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_23, ADC_LED_B);

    const uint32_t ADC_LED_G = (/* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Enable hysteresis */
                                IOCON_PIO_HYS_EN |
                                /* Input not invert */
                                IOCON_PIO_INV_DI |
                                /* Disables Open-drain function */
                                IOCON_PIO_OD_DI |
                                /* Bypass input filter */
                                IOCON_PIO_SMODE_BYPASS |
                                /* IOCONCLKDIV0 */
                                IOCON_PIO_CLKDIV0);
    /* PIO0 PIN6 (coords: 46) is configured as GPIO, PIO0, 6. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_6, ADC_LED_G);

    /* ADC_CHN1 connect to P0_6 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN1, false);

    /* ADC_CHN2 connect to P0_14 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN2, false);

    /* ADC_CHN3 connect to P0_23 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN3, false);

    /* ADC_CHN8 connect to P0_18 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN8, false);

    /* ADC_CHN9 connect to P0_17 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN9, false);

    /* ADC_CHN10 connect to P0_13 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN10, false);

